{
  "architectures": [
    "NewModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 32,
  "initializer_range": 0.02,
  "intermediate_size": 128,
  "layer_norm_eps": 1e-12,
  "layer_norm_type": "layer_norm",
  "logn_attention_clip1": false,
  "logn_attention_scale": false,
  "max_position_embeddings": 1024,
  "model_type": "new",
  "num_attention_heads": 4,
  "num_hidden_layers": 4,
  "pack_qkv": true,
  "position_embedding_type": "rope",
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 1,
  "unpad_inputs": false,
  "use_memory_efficient_attention": false,
  "vocab_size": 33555
}
