{
  "architectures": [
    "AsmEncoder"
  ],
  "attention_probs_dropout_prob": 0.1,
  "embedding_size": 32,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 32,
  "initializer_range": 0.02,
  "intermediate_size": 128,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 1024,
  "model_type": "asm_encoder",
  "num_attention_heads": 4,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "rotary_value": false,
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 2,
  "use_bias": false,
  "use_cache": true,
  "vocab_size": 33555
}
